<?php 

#进一/舍一取整
echo floor(1.99) . ' ' . ceil(1.01) . '<br>';

#分页功能：X条，每页Y条，页数Z
$x = 102;
$y = 10;
echo ceil($x/$y) . '<br>';

#-------------------------------

#幂运算
echo pow(5, 2), '<br>'; 	#5*5

#平方根
echo sqrt(24), '<br>';

echo sqrt(-1), '<br>';		#NAN

#-------------------------------

echo max(1, 2, 5, 3, 3) . ' ' . min(1, 2, 5, 3, 3) . '<br>';

#-------------------------------

echo rand(1, 100), '<br>';

#更好的随机数
echo mt_rand(1, 100), '<br>';

#-------------------------------

#四舍五入

echo round(15.2474) . '<br>';
echo round(15.2474, 2) . '<br>';
echo round(15.2474, 4) . '<br>';

#-------------------------------

#数字格式化
echo number_format(1503152.16134) . '<br>';
#保留4位小数（四舍五入）
echo number_format(1503152.16134, 4) . '<br>';
echo number_format(1503152.16135, 4) . '<br>';

#-------------------------------
#浮点数求余

#echo (1.2 % 0.5) . '<br>';
echo fmod(1.2, 0.5) . '<br>';
echo (3.2 % 2) . '<br>';
echo fmod(3.2, 2) . '<br>';

