<!DOCTYPE html>
<html>
<head>
	<title>作业下载程序</title>
</head>
<body style="text-align: center;">
	<form action="hack.php" method="post" style="font-size: 25px;">
		<input type="checkbox" name="number[]" id="1" value="1"><label for="1">实验一</label><br>
		<input type="checkbox" name="number[]" id="2" value="2"><label for="2">实验二</label><br>
		<input type="checkbox" name="number[]" id="3" value="3"><label for="3">实验三</label><br>
		<input type="checkbox" name="number[]" id="4" value="4"><label for="4">实验四</label><br>
		<input type="checkbox" name="number[]" id="5" value="5"><label for="5">实验五</label><br>
		<input type="checkbox" name="number[]" id="6" value="6"><label for="6">实验六</label><br>
		<input type="checkbox" name="number[]" id="7" value="7"><label for="7">实验七</label><br>
		<input type="checkbox" name="number[]" id="8" value="8"><label for="8">实验八</label><br><br>
		<input type="submit" value="下载" style="font-size: 20px; padding-left: 10px; padding-right: 10px;">
	</form>
	<div style="display: none;">
		<?php 

		if(isset($_POST['number']))
		{
			echo '<br><br>';
			$number = $_POST['number'];
			foreach ($number as $val) {
				echo "尝试下载实验{$val}<br>";
				download($val);
			}
		}

		function download($number)
		{
			$names = array(
				'延发平-2015214251',
				'张晓东-2015214236',
				'李嘉华-2015214242',
				'杨炳烨-2015214253',
				'王凯伦-2015214235',
				'王伟通-2015214254',
				'刘连-2015214239',
				'任新振-2015214246',
				'刘宇翔-2015214237',
				'邓俊兵-2015214234',
				'李永杰-2015214252',
				'刘亿龙-2015214248',
				'刘中元-2015214250',
				'申子良-2015214247',
				'徐朔-2015214245',
				'邬成浩-2015214241',
				'林宗涛-2015214243',
				'刘博开-2015214244',
				'王唯丞-2015214240',
				'安忠明-2015214249',
				'张智博-2015214238',
				'龚超伟-2015214268',
				'马宇龙-2015214272',
				'董埕丞-2015214270',
				'张硕耕-2015214262',
				'曹运鸿-2015214277',
				'李子凡-2015214278',
				'张博宇-2015214264',
				'周云-2015214274',
				'陈凌宇-2015214275',
				'陈立攀-2015214276',
				'焦晗-2015214271',
				'孙绳宇-2015214263',
				'张鑫-2015214293',
				'胡家麟-2015214288',
				'段连鹏-2015214291',
				'焦中昊-2015214295',
				'蔡志梅-2015214294',
				'张超-2015214286',
				'章雨杭-2015214266',
				'王雪峰-2015214261',
				'王冠群-2015214265',
				'刘霖-2015214273',
				'戴张磊-2015214267',
				'李德帅-2015214269',
				'寇兆奎-2015214297',
				'刘桐旭-2015214289',
				'张洪睿-2015214292',
				'杨波-2015214302',
				'马天昊-2015214285',
				'朱立豪-2015214299',
				'郭雷-2015214298',
				'曹兴鼎-2015214287',
				'胡谦-2015214300',
				'李艾青-2015214301',
				'孙明雨-2015214290',
				'姜凯元-2015214296',
				'江涛-2015214317',
				'唐学俊-2015214326',
				'谷田-2015214310',
				'李鑫-2015214323',
				'张鑫-2015214312',
				'徐志远-2015214318',
				'唐慧媛-2015224258',
				'石建鑫-2015224255',
				'俞海涓-2015224260',
				'张润萍-2015224259',
				'白月娇-2015224257',
				'石可欣-2015224256',
				'董泽凯-2015214322',
				'朱江-2015214314',
				'陈文昕-2015214319',
				'李咏华-2015214315',
				'周洋-2015214324',
				'王东浩-2015214321',
				'麻一帆-2015224279',
				'关馨雨-2015224281',
				'翟祎笑-2015224280',
				'杨祉坤-2015224282',
				'何云莲-2015224284',
				'张冠莹-2015224283',
				'黄祖强-2015214320',
				'季天爵-2015214313',
				'李秋雨-2015214325',
				'相宁-2015214309',
				'于新阳-2015214316',
				'王琛-2015214311',
				'陈玉钊-2015224307',
				'王琳-2015224305',
				'孙雅楠-2015224304',
				'周娅娅-2015224308',
				'赵雪梅-2015224306',
				'孙齐浓-2015224303',
				'王诺-2015224330',
				'袁丽伟-2015224331',
				'孙宏波-2015224328',
				'张逸晨-2015224329',
				'韦莹莹-2015224332',
				'张金璐-2015224327',
				'唐丽-2015224333'
			);

			for($i = 0, $len = count($names); $i < $len; $i++)
			{
				$url = "http://222.27.161.245/sybg/report/.net/{$number}/{$names[$i]}.doc";
				echo "<iframe src='{$url}'></iframe>";
				echo "<iframe src='{$url}x'></iframe></td>";
			}
		}
		?>
	</div>
</body>
</html>


